package operators;


public class Speed {
    static  double way = 500;
    static  double time = 150;

    public static void main(String[] args){
        double speed = way / time;
        System.out.println(speed + "km/h!");

    }
}
// Задание страница 101. Написать программу, которая вычисляет скорость для постоянных значений расстояния и времени